alexcvzz.vscode-sqlite
bierner.markdown-emoji
codezombiech.gitignore
davidanson.vscode-markdownlint
donjayamanne.githistory
eamodio.gitlens
esbenp.prettier-vscode
firefox-devtools.vscode-firefox-debug
mechatroner.rainbow-csv
mhutchie.git-graph
michelemelluso.code-beautifier
ms-azuretools.vscode-azure-github-copilot
ms-azuretools.vscode-azure-mcp-server
ms-azuretools.vscode-azureresourcegroups
ms-python.debugpy
ms-python.pylint
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.datawrangler
ms-vscode.cmake-tools
ms-vscode.cpp-devtools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.powershell
ms-windows-ai-studio.microsoft-ai-tools-pack
ms-windows-ai-studio.windows-ai-studio
mtxr.sqltools
mtxr.sqltools-driver-sqlite
myway.sqlite-tool
perkovec.emoji
qwtel.sqlite-viewer
teamsdevapp.vscode-ai-foundry
timonwong.shellcheck
yy0931.vscode-sqlite3-editor
yzhang.markdown-all-in-one
